export const DRIVER_STATUS = new Map([
  ["0", "刪除"],
  ["1", "啟用"], // DEFAULT
  ["2", "停用"]
]);

export const DRIVER_LICENSE_TYPE = new Map([
  //"放入代號依ddl_driver為主
  ["01", "小型車普通駕駛執照"],
  ["02", "大貨車普通駕駛執照"],
  ["03", "大客車普通駕駛執照"],
  ["04", "聯結車普通駕駛執照"],
  ["05", "小型車職業駕駛執照"],
  ["06", "大貨車職業駕駛執照"],
  ["07", "大客車職業駕駛執照"],
  ["08", "聯結車職業駕駛執照"],
  ["09", "國際駕駛執照"],
  ["10", "輕型機車駕駛執照"],
  ["11", "小型輕型機車駕駛執照"],
  ["12", "普通輕型機車駕駛執照"],
  ["13", "重型機車駕駛執照"],
  ["14", "普通重型機車駕駛執照"],
  ["15", "大型重型機車駕駛執照"]
]);

export const DRIVER_LICENSE_INVALID = new Map([
  //"放入代號依ddl_driver為主
  ["Y", "失效"],
  ["N", "未失效"]
]);
